---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.#ctor
source: html/dc655cc1-160c-8b37-9ccc-f8af8f9c6ae3.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.#ctor Method

Initializes a new instance of the FamilyTypeSet class

## Syntax (C#)
```csharp
public FamilyTypeSet()
```